# KAGLE COMPETITION - TITANIC ML from Disaster

## Libraries

In [53]:
import numpy as np
import pandas as pd
import seaborn as sns
import missingno as msno
import matplotlib.pyplot as plt
import titanic_utils

## EDA

In [66]:
train = pd.read_csv('data/train.csv', index_col='PassengerId')

colummns_wnan = train.columns[train.isna().any()].tolist()

### Embark Missing Values

Doing some research to add the missing values of 'Embarked' column:\
62: Icard, Miss. Amelie: https://www.encyclopedia-titanica.org/titanic-survivor/amelia-icard.html\
830: Stone, Mrs. George Nelson (Martha Evelyn): https://www.encyclopedia-titanica.org/titanic-survivor/martha-evelyn-stone.html

We find out both passengers were embarked in Southampton '(S)'

In [85]:
display(train.loc[train['Embarked'].isna(),:])

train['Embarked'] = train['Embarked'].fillna('S')

display(train.loc[(train.index == 62)|(train.index == 830),:])

Empty DataFrame
Columns: [Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,S
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,S

### Cabin Missing Values

We can input some missing 'Cabin' values by looking if some other passanger has the same 'Ticket' and the 'Cabin'

In [92]:
train.sort_values(by='Ticket', inplace=True)
display(train.loc[(train['Ticket'].duplicated())|(train['Cabin'].isna()),:])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
258,1,1,"Cherry, Miss. Gladys",female,30.0,0,0,110152,86.500,B77,S
760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.500,B77,S
559,1,1,"Taussig, Mrs. Emil (Tillie Mandelbaum)",female,39.0,1,1,110413,79.650,E67,S
586,1,1,"Taussig, Miss. Ruth",female,18.0,0,2,110413,79.650,E68,S
476,0,1,"Clifford, Mr. George Quincy",male,NaN,0,0,110465,52.000,A14,S
...,...,...,...,...,...,...,...,...,...,...,...
87,0,3,"Ford, Mr. William Neal",male,16.0,1,3,W./C. 6608,34.375,NaN,S
737,0,3,"Ford, Mrs. Edward (Margaret Ann Watson)",female,48.0,1,3,W./C. 6608,34.375,NaN,S
236,0,3,"Harknett, Miss. Alice Phoebe",female,NaN,0,0,W./C. 6609,7.550,NaN,S
220,0,2,"Harris, Mr. Walter",male,30.0,0,0,W/C 14208,10.500,NaN,S
746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.000,B22,S